---
title: ScheduleSortGroupField
classe: Autodesk.Revit.DB.ScheduleSortGroupField
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# ScheduleSortGroupField

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ScheduleFieldId FieldId { get; set; }` | `scheduleSortGroupField.FieldId` | ScheduleFieldId |
| `Boolean IsValidObject { get; }` | `scheduleSortGroupField.IsValidObject` | Boolean |
| `Boolean ShowBlankLine { get; set; }` | `scheduleSortGroupField.ShowBlankLine` | Boolean |
| `Boolean ShowFooter { get; set; }` | `scheduleSortGroupField.ShowFooter` | Boolean |
| `Boolean ShowFooterCount { get; set; }` | `scheduleSortGroupField.ShowFooterCount` | Boolean |
| `Boolean ShowFooterTitle { get; set; }` | `scheduleSortGroupField.ShowFooterTitle` | Boolean |
| `Boolean ShowHeader { get; set; }` | `scheduleSortGroupField.ShowHeader` | Boolean |
| `ScheduleSortOrder SortOrder { get; set; }` | `scheduleSortGroupField.SortOrder` | ScheduleSortOrder |
| `Void Dispose()` | `scheduleSortGroupField.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```